/*
* Даны значения температуры, наблюдавшиеся в
* течение N подряд идущих дней. Найдите номера дней
* (в нумерации с нуля) со значением температуры выше
* среднего арифметического за все N дней.
* Гарантируется, что среднее арифметическое значений
* температуры является целым числом.
*/
#include <iostream>
#include <vector>

using namespace std;

int main() {
	int n, i, s = 0, k = 0;
	cin >> n;
	vector<int> v(n);
	for (i = 0; i < n; ++i) {
		cin >> v[i];
		s += v[i];
	}
	s /= n;


	for (i = 0; i < n; ++i) {
		if (v[i] > s) {
			++k;
		}
	}
	cout << k << endl;
	for (i = 0; i < n; ++i) {
		if (v[i] > s) {
			cout << i << ' ';
		}
	}
	
	return 0;
}
