/*
* ƒана строка. Ќайдите в этой строке второе вхождение буквы f
* и выведите индекс этого вхождени€. ≈сли буква f в данной строке
* встречаетс€ только один раз, выведите число -1,
* а если не встречаетс€ ни разу, выведите число -2.
* »ндексы нумеруютс€ с нул€.
*/

#include <iostream>
#include <string>

using namespace std;

int main() {
	string s;
	cin >> s;
	int t = -2;

	for (int i = 0; i < s.size(); ++i) {
		if (s[i] == 'f') {
			t++;
			if (t == 0) {
				cout << i;
				return 0;
			}			
		}
	}

	cout << t;

	return 0;
}

