/*
Дан набор строк. Найдите количество уникальных строк в этом наборе.
Формат ввода
Сначала вводится количество строк N, затем — сами N строк, разделённые пробелом.
Все строки состоят лишь из латинских букв, цифр и символов подчёркивания.
Формат вывода
Выведите единственное целое число — количество уникальных строк в данном наборе.
*/
#include <iostream>
#include <set>
#include <string>

using namespace std;


int main() {
	set<string> uniset;
	string s;
	int n;
	cin >> n;
	for (n; n > 0; --n) {
		cin >> s;
		uniset.insert(s);
	}
	cout << uniset.size() << endl;
	return 0;
}